[00:00.000] 作词 : 方文山
    [00:01.000] 作曲 : 周杰伦
    [00:02.000] 编曲 : 林迈可
    [00:03.32]泛黄的春联还残留在墙上
    [00:07.49]依稀可见几个字岁岁平安
    [00:11.60]在我没回去过的老家米缸
    [00:15.76]爷爷用楷书写一个满
    [00:19.92]黄金葛爬满了雕花的门窗
    [00:24.04]夕阳斜斜映在斑驳的砖墙
    [00:28.16]铺着榉木板的屋内
    [00:31.00]还弥漫姥姥当年酿的豆瓣酱
    [00:36.69]我对着黑白照片开始想象
    [00:40.60]爸和妈当年的模样
    [00:45.93]说着一口吴侬软语的姑娘
    [00:49.59]缓缓走过外滩
    [00:53.95]消失的旧时光一九四三
    [00:58.22]在回忆的路上时间变好慢
    [01:02.54]老街坊小弄堂是属于那年代
    [01:06.80]白墙黑瓦的淡淡的忧伤
    [01:10.61]消失的旧时光一九四三
    [01:14.73]回头看的片段有一些风霜
    [01:19.09]老唱盘旧皮箱装满了
    [01:22.34]明信片的铁盒里
    [01:24.73]藏着一片玫瑰花瓣
    [01:43.57]黄金葛爬满了雕花的门窗
    [01:47.89]夕阳斜斜映在斑驳的砖墙
    [01:52.00]铺着榉木板的屋内
    [01:54.74]还弥漫姥姥当年酿的豆瓣酱
    [02:00.53]我对着黑白照片开始想象
    [02:04.44]爸和妈当年的模样
    [02:09.82]说着一口吴侬软语的姑娘
    [02:13.38]缓缓走过外滩
    [02:18.67]消失的旧时光一九四三
    [02:22.99]在回忆的路上时间变好慢
    [02:27.41]老街坊小弄堂是属于那年代
    [02:31.62]白墙黑瓦的淡淡的忧伤
    [02:35.48]消失的旧时光一九四三
    [02:39.55]回头看的片段有一些风霜
    [02:43.96]老唱盘旧皮箱装满了
    [02:47.17]明信片的铁盒里
    [02:49.56]藏着一片玫瑰花瓣
    [02:55.00]制作人：周杰伦
    [02:56.00]合声编写：周杰伦
    [02:57.00]合声：周杰伦
    [02:58.00]录音工程：Gary Yang(J&A STUDIO)
[02:59.00]混音工程：杨大纬(杨大纬录音工作室)
